{
  "quests": {
    "first_scene": {
      "text": "Ты открываешь глаза. Туман стелется по равнине, впереди — слабое пламя. Воздух тяжёл, пахнет гарью. Тебе кажется, что издали слышен чей-то шёпот.\n\nЧто ты сделаешь?",
      "options": [
        ["Подойти к мерцающему пламени", "scene_fire"],
        ["Остаться и прислушаться к шёпоту", "scene_whisper"]
      ]
    },

    "scene_fire": {
      "text": "Ты приближаешься к пламени. Вокруг — следы лагеря Волонтёров. Флаги разорваны, эмблемы растрескались, словно от жара. Пепел ложится на кожу, как снег.\n\nКажется, здесь недавно шла борьба.",
      "options": [
        ["Осмотреть лагерь", "scene_camp"],
        ["Покинуть место", "scene_exit"]
      ]
    },

    "scene_whisper": {
      "text": "Ты остаёшься в тумане. Шёпот становится громче, слова сливаются: «Пепел… руна… пробуждение». На секунду ты чувствуешь, как холод касается твоего сердца.",
      "options": [
        ["Пойти на голос", "scene_camp"],
        ["Отступить назад", "scene_exit"]
      ]
    },

    "scene_camp": {
      "text": "Ты находишь раскопанный пепел. Из земли пробивается слабое голубое сияние. Это — руна. Её очертания дрожат, будто живые. Кажется, она зовёт тебя.\n\nЧто ты сделаешь?",
      "options": [
        ["Прикоснуться к руне", "scene_rune_touch"],
        ["Отойти прочь", "scene_exit"]
      ]
    },

    "scene_rune_touch": {
      "text": "Твой палец касается сияния — и всё вокруг вспыхивает. Вспышка уносит тебя в другой мир. Когда зрение возвращается, ты стоишь у разрушенной станции МЧС. Символы на стенах мерцают в дыму, будто дышат.\n\nИздалека доносится шаг. Кто-то идёт к тебе.",
      "options": [
        ["Позвать", "scene_final"],
        ["Спрятаться за стену", "scene_final"]
      ]
    },

    "scene_final": {
      "text": "Тьма обступает тебя. Последнее, что ты слышишь — гул рун и дыхание, не принадлежащее человеку.\n\nИстория только начинается...",
      "options": [
        ["Начать заново", "first_scene"]
      ]
    },

    "scene_exit": {
      "text": "Ты решаешь уйти. Туман поглощает всё. Огонь гаснет, и лишь холодное эхо шагает за тобой.\n\nТы чувствуешь, что сделаешь это снова.",
      "options": [
        ["Вернуться в начало", "first_scene"]
      ]
    }
  }
}
