import random
from telegram import Update
from telegram.ext import ContextTypes

SYMBOLS = [
    "☽ Луна — внутренний мир и интуиция.",
    "☀ Солнце — энергия и творчество.",
    "⭐ Звезды — судьба и предопределенность.",
    "🌿 Дерево — природа и гармония.",
    "🔥 Огонь — страсть и преобразование.",
    "🌊 Вода — эмоции и чувства.",
    "🌄 Земля — устойчивость и корни.",
    "⚡ Энергия — движущая сила вселенной.",
    "🔥 Свет — мудрость и осознание.",
    "🌌 Вселенная — бесконечность и неизвестность."
]

async def symbol(update: Update, context: ContextTypes.DEFAULT_TYPE):
    selected_symbol = random.choice(SYMBOLS)
    await update.message.reply_text(f"Ваш символ: {selected_symbol}")