from telebot import TeleBot, types

TOKEN = "8296279646:AAG1OrvQlbQgri3WZwiivQ0ylHYrECxHLBY"  # замените на токен вашего бота
bot = TeleBot(TOKEN)

# Ваш уникальный текст для приветствия
WELCOME_TEXT = """
𝕹𝖔𝖘𝖙𝖆𝖎 ✦ 𝕻𝖔𝖗𝖔𝖌 𝕿𝖆𝖎𝖓𝖞  

Добро пожаловать Придший...  
Войдя сюда, откинув сомнения, узрев туман...  
Стань бойцом, стань медиком, стань спасателем... 
Кем угодно стань...


✦ Избери путь...  
✦ войди в тайны мира 
✦ Стань частью круга Nostai. 
"""

# Обработчик всех изменений участников (для супергрупп)
@bot.chat_member_handler()
def greet_new_member(chat_member_update: types.ChatMemberUpdated):
    new_member = chat_member_update.new_chat_member
    chat_id = chat_member_update.chat.id

    # Проверяем, что пользователь стал обычным членом группы
    if new_member.status == 'member':
        # Отправляем ваш уникальный текст-приветствие
        bot.send_message(chat_id, WELCOME_TEXT)

# Запуск бота
bot.infinity_polling()